/**
给定一个数组，它的第 i 个元素是一支给定股票第 i 天的价格。
设计一个算法来计算你所能获取的最大利润。你可以尽可能地完成更多的交易（多次买卖一支股票）。
注意：你不能同时参与多笔交易（你必须在再次购买前出售掉之前的股票）。
示例 1:
输入: [7,1,5,3,6,4]
输出: 7
解释: 在第 2 天（股票价格 = 1）的时候买入，在第 3 天（股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5-1 = 4 。随后，在第 4 天（股票价格 = 3）的时候买入，在第 5 天（股票价格 = 6）的时候卖出, 这笔交易所能获得利润 = 6-3 = 3 。
 */
class Solution {
    public int maxProfit(int[] prices) {
        int result=0;
        //循环到倒数第二个元素就停止
        for (int i=0;i<prices.length-1;i++) {
            //如果下个元素大于当前元素，那么可以理解成
            //买当前元素，下个元素卖掉
            //不停累计财富
            if(prices[i]<prices[i+1]){
                result = result + prices[i+1] - prices[i];
            }
        }
        return result;
    }
}